Hi AWS Team,

We are experiencing a similar issue.

When we change the `allowed_prefixes` list for our `aws_dx_gateway_association`, it is updating the `aws_ec2_transit_gateway_route_table_association` and producing an inconsistent final plan. 

```HCL
resource "aws_dx_gateway" "dx_gateway" {
  name            = var.aws_dx_gateway_name
  amazon_side_asn = var.aws_dx_gateway_asn
}
...
...
...
resource "aws_dx_gateway_association" "dx_gateway_association" {
  dx_gateway_id         = aws_dx_gateway.dx_gateway.id
  associated_gateway_id = data.aws_ec2_transit_gateway.transit_gateway.id

  allowed_prefixes = var.aws_dx_gateway_allowed_prefixes
}

resource "aws_ec2_transit_gateway_route_table_association" "route_table_association" {
  transit_gateway_attachment_id  = data.aws_ec2_transit_gateway_dx_gateway_attachment.gateway_attachment.id
  transit_gateway_route_table_id = var.aws_tgw_dx_rtb_id
}

```

Plan Output: 
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)
Terraform will perform the following actions:
  # data.aws_ec2_transit_gateway_dx_gateway_attachment.gateway_attachment will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ec2_transit_gateway_dx_gateway_attachment" "gateway_attachment" {
      + arn                = (known after apply)
      + dx_gateway_id      = "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"
      + id                 = (known after apply)
      + region             = (known after apply)
      + tags               = (known after apply)
      + transit_gateway_id = "tgw-123xxxxxxxxxxxxxx"
    }
  # aws_dx_gateway_association.dx_gateway_association will be updated in-place
  ~ resource "aws_dx_gateway_association" "dx_gateway_association" {
      ~ allowed_prefixes                    = [
          - "x.x.x.x/x",
          + "x.x.x.x/x",
        ]
        id                                  = "ga-xxxxxxxx-xxxx-xxxx-xxxx-cxxxxxxxxxxxxgw-123xxxxxxxxxxx"
        # (8 unchanged attributes hidden)
    }
  # aws_ec2_transit_gateway_route_table_association.route_table_association will be updated in-place
  ~ resource "aws_ec2_transit_gateway_route_table_association" "route_table_association" {
        id                             = "tgw-rtb-xxxxxxxxxxxxxxxxx_tgw-attach-abcxxxxxxxxxxxxxx"
      + replace_existing_association   = false
      ~ transit_gateway_attachment_id  = "tgw-attach-abcxxxxxxxxxxxxxx" -> (known after apply)
        # (4 unchanged attributes hidden)
    }
Plan: 0 to add, 2 to change, 0 to destroy.
```


Apply Output:
```
...
...
...

│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for module.aws_underlay.aws_ec2_transit_gateway_route_table_association.route_table_association to include new values learned so far
│ during apply, provider "registry.terraform.io/hashicorp/aws" produced an invalid new value for .replace_existing_association: was cty.False, but now null.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```

